app/controllers/api/v1/birthdays_controller.rb

SELECT "birthdays".* FROM "birthdays"
---
      def index
        @birthdays = Birthday.all

INSERT INTO "birthdays" ("firstname", "lastname", "birthdate", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["firstname", "Stephen"], ["lastname", "Cervera"], ["birthdate", "1965-11-10"], ["created_at", "2022-04-19 21:31:01.958406"], ["updated_at", "2022-04-19 21:31:01.958406"]]
---
      def create
        @birthday = Birthday.new(birthday_params)

        respond_to do |format|
          if @birthday.save