app/controllers/api/v1/bookmarks_controller.rb

INSERT INTO "bookmarks" ("title", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Cat Jokes"], ["url", "www.kittyfunny.com"], ["created_at", "2022-04-19 21:33:44.746461"], ["updated_at", "2022-04-19 21:33:44.746461"]]
---
      def create
        @bookmark = Bookmark.new(bookmark_params)

        respond_to do |format|
          if @bookmark.save