app/controllers/api/v1/users_controller.rb

            def create
                user = User.new(email: user_params[:email], password: user_params[:password])

                client_app = Doorkeeper::Application.find_by(uid: params[:client_id])

                return render(json: { error: 'Invalid client ID'}, status: 403) unless client_app

                if user.save
                # create access token for the user, so the user won't need to login again after registration
                access_token = Doorkeeper::AccessToken.create(
                    resource_owner_id: user.id,
                    application_id: client_app.id,
                    refresh_token: generate_refresh_token,
                    expires_in: Doorkeeper.configuration.access_token_expires_in.to_i,
                    scopes: ''
                )
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
INSERT INTO "oauth_access_tokens" ("resource_owner_id", "application_id", "token", "refresh_token", "expires_in", "created_at", "scopes") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

            def generate_refresh_token
                loop do
                # generate a random token string and return it,
                # unless there is already another token with the same string
                token = SecureRandom.hex(32)
                break token unless Doorkeeper::AccessToken.exists?(refresh_token: token)
---
SELECT 1 AS one FROM "oauth_access_tokens" WHERE "oauth_access_tokens"."refresh_token" = $1 LIMIT $2  [["refresh_token", "16787675245ba293dc859340cc1936a96225c0438708f660105be82dcd693c33"], ["LIMIT", 1]]